system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
   (0.0     -4.0   0.0)     // 0
   (10.0    -4.0   0.0)     // 1
   (10.0    -4.0   4.0)     // 2
   (0.0     -4.0   4.0)     // 3
   (0.0     0.0     0.0)    // 4
   (10.0    0.0     0.0)    // 5
   (10.0    0.0     4.0)    // 6
   (0.0     0.0     4.0)    // 7
);

blocks
(
    hex (0 1 5 4 3 2 6 7)   (50 10 10) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (1 5 6 2)
    )
    wall bottom
    (
        (0 1 5 4)
    )
    patch atmosphere
    (
        (3 2 6 7)
    )
    empty frontAndBack
    (
        (0 1 2 3)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
